package secondWeek2ndHW;

public class EightOfPptProbs {

	public static void main(String[] args) {
//		문제
//		1. 1~100까지 3의 배수의 합을 구하세요. (if 사용)
//		2. 3항 연산식 을 이용해서도 구해보세요.
//		1683
//
//		문제
//		1. 양수를 입력 받아, 입력 받은 수 크기의 배열을 생성하세요.
//		2. 배열에 1~입력 받은 수 까지 차례대로 값을 넣으세요.
//		5
//		12345
//		10
//		12345678910
//
//		문제
//		1. 양수를 입력 받으세요.
//		2. 입력 받은 수에 해당하는 구구단을 출력하세요.
//
//		구구단 단수를 입력하세요: 3
//		랜덤 구구단 3단
//		-----
//		3 * 1 = 3
//		3 * 2 = 6
//		-
//		-
//		문제12
//		1. 정수를 입력 받으세요.
//		2. For문을 이용하여 입력 받은 수가 소수인지 판별하세요.
//		3. 힌트) 소수는 나누어 떨어지는 수가 2개이다.
//
//		정수를 입력하세요: 6
//		6은 소수가 아닙니다
//
//		문제
//		1. 2중 for문을 이용하여 다음을 구현하세요. (아래로 표현)
//		2. 실행 결과에 보이는 모든 숫자는 상위for문과, 하위for문에서 사용한 변수로 출력하여야 합니다.
//	
//		문제
//		1. 2중 for문을 이용하여 다음을 구현하세요
		
//		문제
//		1. 정수를 입력 받으세요.
//		2. 2중 for문을 이용하여 입력 받은 수 까지 소수들의 합을 구하세요.
//		3. 힌트) 입력 받은 수까지 반복, 내부 for문 에서 외부 for문의 수까지 반복( 나누어 떨어지는 수 체크)
//
//		문제
//		1. 두 수의 더하기를 맞추는 문제를 지속적으로 출제하는 프로그램입니다.
//		2. 2가지의 정수를 1~100사이의 난수를 발생 시켜 지속적으로 문제를 출제한 후 정답이면
//		정답 카운트를 +1 씩, 틀리면 오답 카운트를 +1 씩 올려주는 프로그램을 만드세요.
//		또 한 이 프로그램은 0 을 입력 받으면 반복을 중단(탈출) 합니다.
//		ex) 27 + 84 = ?
//				
//		문제
//		1. 15번 문제가 – 문제도 나올 수 있도록 변경해 보세요.
//		
//		문제
//		1. Scanner를 이용하여 금액을 입력 받으세요.
//		2. 음료수를 선택하면 금액에서 차감하세요. (반복문)
//		3. 금액이 부족하다면 “금액이 부족합니다“ 를 출력하세요.
//		4. 4를 입력 받으면 반복문 을 종료하세요.
	}
}
